goal_setter/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "JarJarBinks"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "0JYpcLCo3CNt4zgMqBcmuw"], ["updated_at", "2018-12-21 21:36:28.397014"], ["id", 1]]
---
  def reset_session_token!
    self.update!(session_token: self.class.generate_session_token)